# -*- coding utf-8 -*-
import codecs

is_ascii = lambda s: all(ord(c) < 128 for c in s)

f1 = codecs.open('file.sql', 'r', encoding='utf-8')
f2 = open('file3_changed.sql', 'w')

dic = {'–':'-', '“':'"', '”':'"', '»':'"', '«':'"', '№':'N', 'Ь':'&#286;', 'ь':'&#287;', 'Ъ':'&#74;', 'ъ':'&#106;', 'А':'A', 'а':'a', 'Б':'B', 'б':'b', 'В':'V', 'в':'v', 'Г':'Q', 'г':'q', 'Д':'D', 'д':'d', 'Е':'E', 'е':'e', 'Ё':'E', 'ё':'e', 'Ж':'C', 'ж':'c', 'З':'Z', 'з':'z', 'И':' &#304;', 'и':'i', 'Й':'Y', 'й':'y', 'К':'K', 'к':'k', 'Л':'L', 'л':'l', 'М':'M', 'м':'m', 'Н':'N', 'н':'n', 'О':'O', 'о':'o', 'П':'P', 'п':'p', 'Р':'R', 'р':'r', 'С':'S', 'с':'s', 'Т':'T', 'т':'t', 'У':'U', 'у':'u', 'Ф':'F', 'ф':'f', 'Х':'X', 'х':'x','Ц':'u', 'ц':'u', 'Ч':'&#199;', 'ч':'&#231;', 'Ш':'&#350;', 'ш':'&#351;', 'Щ':'&#72;', 'щ':'&#104;', 'Ы':'&#305;','ы':'&#305;', 'Э':'&#610;', 'э':'&#609;', 'Ю':'&#214;', 'ю':'&#246;', 'Я':'&#399;', 'я':'&#601;', 'Ə':'&#399;', 'ə':'&#601;'}
alphabet = ['–', '“', '”', '»', '«', '№', 'Ь', 'ь', 'Ъ', 'ъ', 'А', 'а', 'Б', 'б', 'В', 'в', 'Г', 'г', 'Д', 'д', 'Е', 'е', 'Ё', 'ё', 'Ж', 'ж', 'З', 'з', 'И', 'и', 'Й', 'й', 'К', 'к', 'Л', 'л', 'М', 'м', 'Н', 'н', 'О', 'о', 'П', 'п', 'Р', 'р', 'С', 'с', 'Т', 'т', 'У', 'у', 'Ф', 'ф', 'Х', 'х', 'Ц', 'ц', 'Ч', 'ч', 'Ш', 'ш', 'Щ', 'щ', 'Ы', 'ы', 'Э', 'э', 'Ю', 'ю', 'Я', 'я', 'Ə', 'ə']

for line in f1:
    st = line
    result = str()
    len_st = len(st)
    for i in range(0,len_st):
        if st[i] in alphabet:
            simb = dic[st[i]]
        else:
          if is_ascii(st[i]):
            simb = st[i]
          else:
            simb = "{X}"
        result = result + simb
    if result[-1] == "\n":
      result = result[:-1]
    f2.write(result)

f1.close()
f2.close()